Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་ཀྱི་གསུང་རབ་ལ་ཁྱེའུ་ཞིག་བྱུང་བ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་ཐེ་ཚོམ་དང་ཡིད་གཉིས་ཟ་ན་ དེ་ལྟར་མི་བལྟའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཀྱི་བསྟན་པ་ལ་ཁྱེའུ་དེར་གྱུར་ཏོ། ། དེ་ཕྱིས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཏུ་ལོག་པར་ལྟུང་བར་མ་སོང་ངོ་། ། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འདས་པའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྙིང་རྗེ་ཅན་ཞེས་བྱ་བར་འགྱུར་ཏེ། འཁོར་ལོས་སྒྱུར་བའི་རིགས་ལས་མངོན་པར་འབྱུང་བར་འགྱུར་རོ། ། དེའི་དུས་ན་དེའི་ཡབ་ནི་གྲགས་པ་ཞེས་བྱ་བར་འགྱུར་ཏེ། འདི་ལྟ་སྟེ་དཔེར་ན་ད་ལྟར་ངའི་ཡབ་ཟས་གཙང་མ་བཞིན་ནོ། ། དེའི་ཡུམ་མུན་པ་དང་བྲལ་བ་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། དཔེར་ན་ད་ལྟར་ངའི་ཡུམ་སྒྱུ་འཕྲུལ་བཞིན་ནོ། ། དེའི་དུས་ན་མྱ་ངན་མེད་ཅེས་བྱ་བ་སྲས་སུ་འགྱུར་བ་ནི་འདི་ལྟ་སྟེ་དཔེར་ན། ད་ལྟར་ངའི་སྲས་སྒྲ་གཅན་ཟིན་བཞིན་ཏེ། དེ་བྱུང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། དེ་བྱང་ཆུབ་ཐོབ་པ་ན་དེའི་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱ་སྟོང་དུ་འགྱུར་རོ། ། སངས་རྒྱས་དེའི་འོད་ཀྱིས་དཔག་ཚད་སྟོང་ཕྲག་བཅུར་ཁྱབ་པར་འགྱུར་རོ། ། དེའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ནི་དཔག་ཚད་བརྒྱར་འགྱུར་རོ། ། དེའི་ཉན་ཐོས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། །བྱེ་བ་ཁྲག་ཁྲིག་དང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་འདུས་པ་འབྱུང་སྟེ། དེའི་ཉན་ཐོས་བྱེ་བ་ནི་དགྲ་བཅོམ་པ་འབའ་ཞིག་སྟེ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མངོན་པར་ཤེས་པ་དྲུག་དང་ལྡན་པ་ཤ་སྟག་སྟེ། ། ཤཱ་རིའི་བུ་དགྲ་བཅོམ་པ་དེ་དག་དཀོན་མཆོག་གསུམ་འདུས་པ་ཐོབ་པ་ཡོངས་སུ་བརྗོད་པ་འབྱུང་བ་དེ་སྙེད་ཀྱི་དེའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་འབྱུང་སྟེ། ཐམས་ཅད་ཀྱང་སྔོན་མར་གྱུར་པ་ཤ་སྟག་གོ ། ཕྱིར་མི་ལྡོག་པའི་ཆོས་བསྟན་ཏེ། ཚད་མེད་གྲངས་མེད་པའི་སེམས་ཅན་གྱི་དོན་བྱས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་ཏེ། དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་ལོ་བྱེ་བར་གནས་པར་འགྱུར། དེའི་རིང་བསྲེལ་ཡང་རྒྱས་པར་འགྱུར་ཏེ་འདི་ལྟ་སྟེ་དཔེར་ན། ད་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་རིང་བསྲེལ་རྒྱས་པར་འགྱུར་བ་བཞིན་ནོ། །
en: “Śāriputra, there should be no doubt or uncertainty as to whether it was that boy and no other that the lord Vipaśyin was talking about at that time, on that occasion. There is no need to raise questions about this. Why should there be no doubt about this? The divine son Maheśvara witnessed the Lord, the tathāgata, arhat, fully accomplished Buddha Vipaśyin, make these statements about the boy at that time, on that occasion. For a million billion eons he will not fall into the lower states of existence, and after a million billion eons have passed, he will be born into the family of a king of the entire world, and he will become a tathāgata, arhat, fully accomplished buddha by the name of Kāruṇika. His father’s name will be Abhiyaśa, just as my father’s name was Śuddhodana. His mother’s name will be Vigatatamā, just as my mother’s name was Māyā. His son’s name will be Aśoka, just as my son’s name is Rāhula. He will leave everything behind and become an unsurpassed, fully accomplished buddha. When he has reached awakening, he will live for a hundred thousand million billion years. The radiance of his awakening will extend for over ten thousand yojanas, and his assembly will extend for a hundred yojanas. He will have three assemblies of śrāvakas: one of a billion śrāvakas, one of a hundred thousand trillion śrāvakas, and one of a hundred billion trillion śrāvakas. Ten million of them will be pure arhats who will have eliminated the defilements, who will be without vices, who will possess powers, who will dwell in the concentrations of the eight liberations, and who will possess the six superior abilities. Furthermore, Śāriputra, his saṅgha of bodhisatvas will be just as renowned as the arhats, who will have become part of the assembly belonging to the Three Jewels. As everyone has been his mother, he will teach the Dharma unfalteringly, benefitting uncountable innumerable sentient beings, and then pass into final nirvāṇa. After his final nirvāṇa, the true Dharma will remain for ten million years, and his ashes will be distributed far and wide, just as my ashes will be distributed far and wide after my final nirvāṇa.

source: ཤཱ་རིའི་བུ་འདི་ནི་སྐྱེས་བུ་དམ་པས་རྣམ་པར་བརྟག་པ། སྐྱེས་བུ་དམ་པས་བལྟ་བ། བརྩོན་འགྲུས་མ་ཉམས་པ། སྐྱེས་བུ་དམ་པ། བརྩོན་འགྲུས་མི་ཟློགས་པ་སྟེ། དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྗེས་སུ་དྲན་པའི་སེམས་བསྐྱེད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བརྩོན་འགྲུས་རབ་ཏུ་བརྩམ་པར་བྱ་བར་གྲངས་ཀྱིས་བགྲང་བ་དེ་སྙེད་དུ་བཙལ་ཞིང་བསྐལ་པ་དེ་སྙེད་དུ་ནི་འཁོར་བར་བྱའོ། ། བསྐལ་པ་དེ་སྙེད་དུ་ནི་མི་འཁོར་བར་བྱའོ་ཞེས་དེ་ལྟར་མི་བྱའི། །ཤཱ་རིའི་བུ་བསམ་གྱིས་མི་ཁྱབ་པའི་གོ་ཆ་བགོ་བར་བྱ་སྟེ། འཁོར་བའི་མཐའ་མའི་མཐའ་ཇི་ཙམ་པར་བདག་འཁོར་བར་བྱ་བའི་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། བྱང་ཆུབ་ཀྱི་ཕྱིར་བརྩོན་འགྲུས་ལྷོད་པར་མི་བྱ་སྟེ། བརྩོན་འགྲུས་མི་ལྡོག་བརྟུལ་བ་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Śāriputra, honorable men should investigate, honorable men should observe, that it is through the unfailing, unyielding vigor of an honorable man that a bodhisatva, a great being, cultivates a mind filled with awareness. He applies himself with vigor to the attainment of unsurpassed perfect awakening to such a degree that he thinks, ‘We will wander in saṃsāra for more eons than can possibly be counted.’ He does not say, ‘We cannot wander in saṃsāra for that long,’ but instead, Śāriputra, he dons the armor of inconceivability and thinks to himself, ‘We will roam here until the very end of saṃsāra. We will not let our vigor falter, in order to attain awakening.’ His vigor is unfaltering and courageous.

source: བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྟུལ་བ་གང་ཞེ་ན། བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་མེས་ཡོངས་སུ་གང་བ་ལ་རྒལ་ཞིང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བལྟ་བའི་ཕྱིར་འགྲོ་བར་སྤྲོ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པའོ། ། དམ་པའི་ཆོས་མཉན་པའི་ཕྱིར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་མེས་ཡོངས་སུ་གང་བ་ལ་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། རྒལ་ཞིང་འགྲོ་བར་སྤྲོ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པའོ། ། གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་མེས་ཡོངས་སུ་གང་བ་ལ་རྒལ་ཞིང་དགེ་བའི་རྩ་བའི་ཕྱིར་འགྲོ་བར་སྤྲོ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པའོ། །
en: “What is the bodhisatva’s unfaltering courageous vigor like? The bodhisatva’s unfaltering courageous vigor is such that if one imagines that the great thousand three-thousandfold worlds were filled with raging fires, he would happily plunge into them in order to be able to meet the tathāgatas, the arhats, the fully accomplished buddhas. The bodhisatva’s unfaltering courageous vigor is such that in order to be able to hear the true Dharma, he would happily plunge into fires that filled the three-thousandfold worlds. The bodhisatva’s unfaltering courageous vigor is such that for the purpose of cultivating roots of virtue, he would happily plunge into fires that filled the great thousand three-thousandfold worlds. This is what the bodhisatva’s unfaltering courageous vigor is like.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པ་ནི་གང་གཞན་གྱི་དོན་གྱི་ཕྱིར་རྟུལ་བསྐྱེད་པའོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པ་ནི། གང་གཞན་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་རྟུལ་བསྐྱེད་པའོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྟུལ་བ་མ་ནི་མི་ལྷོད་པ་དང་། བརྟན་པ་དང་། མི་ལྡོག་པ་དང་། བསམ་པ་དགེ་བ་དང་། །སྙིང་རྗེ་ཆེན་པོས་རབ་ཏུ་ནོན་པས་རྟག་ཏུ་སེམས་ཅན་གྱི་དོན་ལ་བརྩོན་ཞིང་རྟུལ་བསྐྱེད་པའོ། །གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པ་ནི་གང་གོམ་པ་འདེག་ཅིང་འདོར་བ་ན་ཡང་བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་སྟེ། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་མངོན་སུམ་དུ་བྱེད་ཅིང་སེམས་ཅན་ལ་ལྟ་ཡང་ཉོན་མོངས་པའི་དབང་གིས་མི་འགྲོ་བའོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པ་ནི་གང་དགེ་བའི་རྩ་བའི་སེམས་སྐྱེས་ཤིང་བྱུང་བ་རྣམས་བྱང་ཆུབ་ཏུ་སྔོ་བ་སྟེ། དེའི་དགེ་བའི་རྩ་བ་དེ་མི་ཟད་པར་འགྱུར་ཏེ། ། ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོར་སོང་བའི་ཆུ་ནི་བར་མ་དོར་ཟད་པར་མི་འགྱུར་བ་དེ་བཞིན་དུ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་ཏུ་བསྔོས་པའི་དགེ་བའི་རྩ་བ་ཡང་བར་མ་དོར་ཟད་པར་མི་འགྱུར་ཏེ དེའི་ཕྱིར་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པ་ཞེས་བྱའོ། །ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པར་ཡང་དག་པར་ཞུགས་པ་ནི་དགེ་བའི་རྩ་བ་དེ་དག་སྡུད་ཅིང་ཐམས་ཅད་མཁྱེན་པའི་རྣམ་པ་མངོན་པར་སྒྲུབ་པའི་དགེ་བའི་རྩ་བ་སྡུད་པས་དེའི་ཕྱིར་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པ་ཞེས་བྱའོ། །
en: “Śāriputra, the bodhisatva’s unfaltering courageous vigor is also such that he is concerned for the welfare of others. Śāriputra, the bodhisatva’s unfaltering courageous vigor is also such that he courageously exerts himself in order to help others attain final nirvāṇa. Śāriputra, the bodhisatva’s unfaltering courageous vigor is also such that he does not relax, that he is stable, that he does not turn back, that his motivation is wholesome, and that he feels the sting of great compassion, so that he is constantly working to provide sentient beings with what they need. Śāriputra, the bodhisatva’s unfaltering courageous vigor is also such that he will never be parted from the mind of awakening, not even for a single step he takes. He will always be focused on the Buddha, the Dharma, and the Saṅgha, and when he encounters sentient beings he will not let the vices take hold of him. Śāriputra, the bodhisatva’s unfaltering courageous vigor is also such that whenever any root of virtue appears in his mind he dedicates it to awakening, and in this way his roots of virtue become inexhaustible. Śāriputra, just as the rivers that run into the great ocean are never exhausted, virtue that is dedicated to awakening is never exhausted. This is what the bodhisatva’s unfaltering courageous vigor is like. “Furthermore, Śāriputra, the bodhisatva who correctly applies himself with unfaltering courageous vigor accumulates roots of virtue. He accumulates roots of virtue that will enable him to attain mastery in the various different aspects of omniscience. This is what the bodhisatva’s unfaltering courageous vigor is like.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ནི་འདི་ལྟར་སློབ་སྟེ། སེམས་ཅན་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་སྙེད་པ་དང་། སློབ་པ་དང་། མི་སློབ་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་སྙེད་པ་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་སྙེད་པ་དང་། བསོད་ནམས་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྐུའི་བ་སྤུའི་ཁུང་བུ་གཅིག་ཡོངས་སུ་འགྲུབ་བོ། །བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་དུ་གཏོགས་པ་ཇི་སྙེད་པ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་ནི་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་བྱས་ན་ འགྲུབ་པར་འགྱུར་རོ། ། དེ་ལྟ་བུའི་མཆོད་སྦྱིན་བརྒྱས་ནི་སྐུ་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་གཅིག་མངོན་པར་འགྲུབ་བོ། །དེ་ལྟར་འཇུག་པས་མཚན་ཐམས་ཅད་ཀྱང་མངོན་པར་འགྲུབ་པོ། །མཚན་ཐམས་ཅད་དུ་གཏོགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་སྙེད་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ཡོངས་སུ་འགྲུབ་བོ། །མཛོད་སྤུར་གཏོགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་སྙེད་པ་དེ་ལས་བརྒྱ་ཕྲག་སྟོང་དུ་བསྒྲེས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོས་ནི་དེ་བཞིན་གཤེགས་པའི་གཙུག་ཏོར་དབུའི་གཙུག་བལྟར་མི་མཐོང་བའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་མངོན་པར་འགྲུབ་པོ། །གཙུག་ཏོར་དུ་གཏོགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་སྙེད་པ་ལས་བྱེ་བ་བརྒྱ་སྟོང་དུ་བསྒྲེས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོས་ནི་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་དུང་ཡོངས་སུ་འགྲུབ་སྟེ འདོད་ན་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་དུང་དེས་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཀྱིས་གོ་བར་མཛད་དེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཇི་ལྟ་བུར་མོས་ཤིང་འདུལ་བ་བཞིན་དུ་ཚིམ་པར་མཛད་དོ། ། དེ་ལྟར་དཀའ་བས་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འགྲུབ་ཀྱང་བདག་གདོན་མི་ཟ་བར་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱས་ཏེ མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སངས་རྒྱས་ཀྱི་དབྱངས་ཀྱིས་གོ་བར་བྱའོ་ཞེས་སྤྲོ་ཞིང་། གོ་ཆ་མི་འདོར་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པའོ། །
en: “Furthermore, Śāriputra, the bodhisatva trains himself in the following way. If one takes the entirety of the merit of all sentient beings, the entirety of the merit of all those who are in training and all those who require no more training, and the entirety of the merit of all pratyekabuddhas, this whole mass of merit, no matter how great it may be, would amount to only one pore on the body of the Tathāgata, and if one were to take the entirety of merit encompassed by all the pores on the Tathāgata’s body and perform an elaborate hundredfold Vedic offering, the merit gained in this way would be enough for one to attain one of the characteristics of a great being. By making offerings in this way, one can attain all the characteristics of a great being. The amount of merit required to obtain all the previous characteristics of a great being in this way is the same as the amount of merit required to obtain the ūrṇā curl between the eyebrows of a tathāgata. If one then takes the amount of merit required to obtain an ūrṇā curl and multiplies it by hundred thousand, then this is the amount of merit required to obtain the invisible crown protrusion on the head of a tathāgata, the final physical characteristic of a great being. If one then takes the amount of merit required to obtain an invisible crown protrusion and multiplies it by ten billion, then this is the amount of merit required to manifest a tathāgata’s great conch shell of the Dharma. If he so wishes, a tathāgata can use this conch shell of the Dharma to make his voice heard to the very ends of the earth, in a way that delights the sense faculties of all sentient beings, and that suits their inclinations and their needs in relation to the training. The bodhisatva therefore thinks, ‘Although attaining unsurpassed perfect awakening is very demanding, I must nonetheless attain unsurpassed perfect awakening by any means necessary, so that I can make the words of the Buddha known to the ends of the earth.’ With this courageous attitude, he does not allow his armor to fail. This is what the bodhisatva’s unfaltering courageous vigor is like.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པ་ནི་གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་དད་པས་རྗེས་སུ་འབྲང་བའི་ཡེ་ཤེས་དང་ལྡན་པར་གྱུར་པས་ནི་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཡེ་ཤེས་དང་ལྡན་པ་དེའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། ། སྟོང་གི་ཆ་འམ། བརྒྱ་ཕྲག་སྟོང་གི་ཆ་འམ། ཆར་རམ། བགྲང་བར་རམ། རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོའོ། ། གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། དེ་ལྟར་གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་རྒྱུན་དུ་ཞུགས་པའི་ཡེ་ཤེས་དང་ལྡན་པར་གྱུར་པ་དང་། དེ་དག་ལན་ཅིག་ཕྱིར་འོང་བའི་ཡེ་ཤེས་དང་ལྡན་པ་དང་། དེ་བཞིན་དུ་ཕྱིར་མི་འོང་བའི་ཡེ་ཤེས་དང་ལྡན་པ་དང་། དེ་བཞིན་དུ་དགྲ་བཅོམ་པའི་ཡེ་ཤེས་དང་ལྡན་པ་དང་། དེ་བཞིན་དུ་རང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དང་ལྡན་པ་དང་། དེ་བཞིན་དུ་བསྐལ་པ་བརྒྱས་འབྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་དུ་ཕྱིར་མི་ལྡོག་པའི་ཡེ་ཤེས་དང་ལྡན་པ་དང་། དེ་བཞིན་དུ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་སྟེ། རྒྱས་པར་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་དང་ལྡན་པར་གྱུར་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་གནས་དང་གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་དེའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། ། སྟོང་གི་ཆར་རམ། བརྒྱ་ཕྲག་སྟོང་གི་ཆར་རམ། གྲངས་སུ་འམ། ཆར་རམ། བགྲང་བར་རམ། རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོའོ། ། ཡེ་ཤེས་ལ་འཇུག་པ་འདི་ཐོས་ནས། མི་དང་མི་སྐྲག་སྐྲག་པར་མི་འགྱུར་ཞིང་ཡེ་ཤེས་དེ་ལ་འཇུག་པར་མོས་པ་བསྐྱེད་དེ། བརྩོན་འགྲུས་རྟུལ་རྩོམ་ཞིང་བྲི་དང་། རྒྱུས་པ་དང་། རུས་པ་དང་། པགས་པ་དང་། ཤ་དང་། ཁྲག་དང་། ལུས་ཡོངས་སུ་སྐམས་པར་གྱུར་ཀྱང་སླའི། དེ་བཞིན་གཤེགས་པའི་སྟོབས་མ་ཐོབ་ཀྱི་བར་དུ་བརྩོན་འགྲུས་ཉམས་པར་མི་འགྱུར་བ་དེ་ནི་བརྩོན་འགྲུས་བ་མ་ཉམས་པ་ཞེས་བྱའོ། །
en: “Furthermore, Śāriputra, a bodhisatva who applies himself with unfaltering courageous vigor might hear it said, ‘If the beings in this threefold thousand great thousandfold universe were all to attain knowledge that accords with purity, this would not amount to even a hundredth part of the knowledge of someone who had attained knowledge that accords with the Dharma. It would not amount to a thousandth or a hundred thousandth part. It would not amount to any fraction that can be calculated or expressed, and so forth. In the same way, if the beings in this threefold thousand great thousandfold universe were all to attain the knowledge of a stream enterer, the knowledge of a once-returner, the knowledge of a non-returner, the knowledge of an arhat, the knowledge of a pratyekabuddha, the knowledge of a bodhisatva who appears once every hundred eons, the knowledge of an irreversible bodhisatva, or the knowledge of a bodhisatva who has only one existence remaining, no matter how many sentient beings there might be in the universe, even if they were all to attain the knowledge of the bodhisatva who has only one existence remaining, this would not even amount to a hundredth part of the tathāgata’s power to know what is the case and what is not the case. It would be an incalculably, incomparably small fraction of a thousandth or a hundred thousandth of this power.’ When he hears about this way into knowledge, he does not become intimidated. He is not scared, he is not frightened, but he is motivated to gain access to this knowledge and applies himself to this task with vigor. Even if his physical body, with its sinews, muscles, bones, skin, flesh, and blood, were to dry up, he would not allow his vigor to falter if he had still not attained the powers of a tathāgata. This is what the bodhisatva’s unfaltering courageous vigor is like.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སློབ་སྟེ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདས་པའི་སེམས་ཇི་སྙེད་པ་དེ་དག་སེམས་ཅན་གཅིག་གི་སེམས་གཅིག་ཏུ་ཞུགས་པར་གྱུར་ལ། དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དེ་སྙེད་དུ་ཚད་མེད་ཅིང་མང་བར་གྱུར་ཏེ གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་གང་བའི་སེམས་དེ་དག་སེམས་ཅན་གཅིག་གི་སེམས་གཅིག་ལ་འཇུག་པར་གྱུར་ལ། རྣམ་གྲངས་འདིས་སེམས་ཅན་ཐམས་ཅད་དེ་སྙེད་ཀྱི་ཉོན་མོངས་པ་མང་པོ་ཚད་མེད་པར་གྱུར་ཀྱང་། དེ་ལ་བདག་གིས་དེ་འདྲ་བའི་ཤེས་རབ་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་བཙལ་བར་བྱ། འབད་པར་བྱ། བརྩོན་འགྲུས་བརྩམ་པར་བྱ་སྟེ། ཇི་ལྟར་བརྩོན་འགྲུས་བརྩམས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་ཀྱི་ཀུན་ཏུ་གདུང་བ་དང་། ཞེ་སྡང་གི་ཀུན་ཏུ་གདུང་བ་དང་། གཏི་མུག་གི་ཀུན་ཏུ་གདུང་བ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱ། དུག་མེད་པར་བྱ། གཞོམ་པར་བྱ། དགྲོལ་བར་བྱ། ཐལ་བར་བྱ། མྱ་ངན་ལས་འདས་པའི་ལམ་ལ་རབ་ཏུ་དགོད་པར་བྱའོ་སྙམ་དུ་གང་དེ་ལ་རྟུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པ་ཞེས་བྱའོ། །
en: “Furthermore, Śāriputra, the bodhisatva trains himself by thinking in the following way: ‘However many thoughts sentient beings have had in the past, they can all be included within a single thought of a single sentient being. So, however incalculably many thoughts sentient beings may have had, however great the vices of attachment, aversion and confusion that afflict all sentient beings may be, they can all be reduced to a single thought of a single sentient being. I will take this approach and apply myself with vigor and perseverance in my quest to accumulate knowledge and wisdom, no matter how immeasurably great the vices may be. By applying vigor in this way, I will pacify all the attachment, aversion, and confusion that torment all sentient beings. I will remove these poisons. I will destroy them. I will unmask them. I will reduce them to ashes. I will establish these sentient beings on the path to nirvāṇa.’ Such is his courage. This is what the bodhisatva’s unfaltering courageous vigor is like.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་རྟུལ་བ་མ་ཉམས་པ་ནི་གང་ལུས་ཀྱི་ལས་དགེ་བ་ལ་གནས་པ་དང་། ངག་གི་ལས་དགེ་བ་ལ་གནས་པ་དང་། ཡིད་ཀྱི་ལས་དགེ་བ་ལ་གནས་པ་དང་། བརྩོན་འགྲུས་གང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ལུས་དང་། ངག་དང་། སེམས་དང་ལྡན་པའོ། ། ལུས་དང་། ངག་གི་བརྩོན་འགྲུས་པས་སེམས་ཀྱི་བརྩོན་འགྲུས་ཉིད་མཆོག་ཅེས་བཤད་དོ། ། དེ་ལ་སེམས་ཀྱི་བརྩོན་འགྲུས་གང་ཞེ་ན། གང་སེམས་ཀྱི་འཇུག་པ་དང་གནས་པའོ། ། དེ་ལ་སེམས་ཀྱི་འཇུག་པ་གང་ཞེ་ན། གང་བྱང་ཆུབ་ལ་རྩོལ་བའོ། ། དེ་ལ་སེམས་ཀྱི་གནས་པ་གང་ཞེ་ན། གང་བྱང་ཆུབ་ཀྱི་སེམས་ཉེ་བར་མ་ཞི་བའོ། ། དེ་ལ་འཇུག་པ་གང་ཞེ་ན། གང་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེ་བའོ། ། དེ་ལ་གནས་པ་གང་ཞེ་ན། གང་བདག་མེད་པ་ལ་བཟོད་པའོ། ། དེ་ལ་འཇུག་པ་གང་ཞེ་ན། གང་སེམས་ཅན་ཐམས་ཅད་སྡུད་པའོ། ། དེ་ལ་གནས་པ་གང་ཞེ་ན། གང་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་འདོགས་པའོ། །
en: “Furthermore, Śāriputra, the bodhisatva applies himself with unfaltering courageous vigor. He bases himself on wholesome physical actions, he bases himself on wholesome verbal actions, he bases himself on wholesome mental actions, and with all the physical, verbal, and mental vigor he possesses, he applies himself with body, speech, and mind. It is said that it is better to have mental vigor than physical or verbal vigor. What is mental vigor? It is to be mentally engaged and settled. In what way is he mentally engaged? He makes an effort to attain awakening. In what way is he mentally settled? He does not let the mind of awakening fade. In what way is he mentally engaged? He has great compassion for all sentient beings. In what way is he mentally settled? He accepts selflessness. In what way is he mentally engaged? He attracts sentient beings to him. In what way is he mentally settled? He will help any sentient being.

source: འཇུག་པ་ནི་འཁོར་བས་ཡོངས་སུ་མི་སྐྱོའོ། ། གནས་པ་ནི་ཁམས་གསུམ་མི་དམིགས་པའོ། ། འཇུག་པ་ནི་ནོར་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའོ། ། གནས་པ་ནི་སྦྱིན་པ་མི་སྙེམས་པའོ། ། འཇུག་པ་ནི་ཚུལ་ཁྲིམས་ཡང་དག་པར་འཛིན་པའོ། ། གནས་པ་ནི་ཚུལ་ཁྲིམས་མི་སྙེམས་པའོ། ། འཇུག་པ་ནི་བཟོད་པས་སྡུག་བསྔལ་བཟོད་པའོ། ། གནས་པ་ནི་སེམས་མི་འཁྲུག་པའོ། ། འཇུག་པ་ནི་དགེ་བའི་རྩ་བའི་ཆོས་ཐམས་ཅད་རྩོམ་པའོ། ། གནས་པ་ནི་སེམས་རབ་ཏུ་དབེན་པའོ། ། འཇུག་པ་ནི་བསམ་གཏན་སྒྲུབ་པའོ། ། གནས་པ་ནི་སེམས་ངེས་པར་རྟོག་པའོ། ། འཇུག་པ་ནི་ཐོས་པས་མི་ངོམས་པའོ། ། གནས་པ་ནི་ཚུལ་བཞིན་རབ་ཏུ་སྦྱོར་བའོ། ། འཇུག་པ་ནི་ཐོས་པ་སྟོན་པའོ། ། གནས་པ་ནི་བརྗོད་དུ་མེད་པའི་ཆོས་ཉིད་དོ། ། འཇུག་པ་ནི་ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་ཚོལ་བའོ། ། གནས་པ་ནི་སྤྲོས་པ་ཐམས་ཅད་ཡང་དག་པར་གཅོད་པའོ། ། འཇུག་པ་ནི་ཚངས་པའི་གནས་སོགས་པའོ། ། གནས་པ་ནི་ཡང་དག་པའི་ཡེ་ཤེས་ཀྱི་བཏང་སྙོམས་སོ། ། འཇུག་པ་ནི་མངོན་པར་ཤེས་པ་ལྔ་ཡོངས་སུ་རྫོགས་པའོ། ། གནས་པ་ནི་ཟག་པ་ཟད་པ་ཡོངས་སུ་འདྲིས་པར་བྱེད་པའོ། ། འཇུག་པ་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པའོ། །
en: “He engages by not becoming disheartened by cyclic existence. He is settled in not reifying the three realms. He engages by abandoning any idea of ownership. He is settled in having no conceit when he is generous. He engages by maintaining his moral conduct. He is settled in having no conceit about his morality. He engages with patience by being able to endure suffering. He is settled in not allowing his mind to become disturbed. He engages by applying himself to all roots of virtue. He is settled in his mental disengagement. He engages by mastering meditation. He is settled in mental introspection. He engages by being keen to learn more. He is settled because his practice is not superficial. He engages by teaching what he has heard. He is settled in the ineffable nature of the teaching. He engages by seeking to accumulate knowledge. He is settled as he severs all conceptual elaboration. He engages in developing the pure states. He is settled in the equanimity of real knowledge. He engages in perfecting the five superior abilities. He is settled in his mastery of the elimination of defilements. He engages by training himself in the application of mindfulness.
